// - Є змінна х, якій ви надаєте довільне числове значення.
//      Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('namber');
// if (x > 0 || x < 0){
//     console.log('Вірно');
// }  else{
//     console.log('Невірно');}

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time = +prompt('Ведіть число від 0 до 59');
// if (time > 0 && time < 15) {
//     console.log("Перша чверть години");
// } else if (time >= 15 && time <= 29) {
//     console.log("Друга чверть години");
// } else if (time >= 30 && time <= 44) {
//     console.log("Третя чверть години");
// } else if (time >= 45 && time <= 59) {
//     console.log("Четверта чверть години");
// } else {
//     console.log('Ви ввели невірне значення');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('Введіть число від 1 до 31')
// if ( day>=1 && day <11) {
//     console.log('число першої декади місяця');
// } else if ( day>=11 && day <21) {
//     console.log('число другої декади місяця');
// } else if ( day>=21 && day <31) {
//     console.log('число третьої декади місяця');
// } else {
//     console.log('Ви ввели невірне значення');
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
// let namber_day = +prompt('Введіть порядковий номер дня тижня від 1 до7')
// switch (namber_day){
//     case (1):
//         console.log('Mondey');
//         break;
//     case (2):
//         console.log('Tuesday');
//         break;
//     case (3):
//         console.log('Wednesday');
//         break;
//     case (4):
//         console.log('Thursday');
//         break;
//     case (5):
//         console.log('Friday');
//         break;
//     case (6):
//         console.log('Saturday');
//         break;
//     case (7):
//         console.log('Sunday');
//         break;
//     default:  console.log('не вірне число вводу');
//
// }

//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.
// let a = +prompt('Введіть число')
// let b = +prompt('Введіть число')
// if (a>b) {
//     console.log (a,"більше з двох введених");
// }else if (b>a){
//     console.log(b,"більше з двох введених");
// } else {
//     console.log("введені числа рівні");
// }

//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
// let x= +prompt('введіть будь-яке значення') || 'default'
// console.log(x);